module ApplicationHelper
  # order_status: {1: 未处理, 2: 已确定, 3: 已取消}
  # pay_status: {1: 未付款, 2: 已付款}
  # logistics_status: {1: 备货中, 2: 已发货, 3: 已收货, 4: 已退货}
  def order_status(status)
    case status
      when 1
        '未处理'
      when 2
        '已确定'
      when 3
        '已取消'
      else
        '未知错误'
    end
  end

  def pay_status(status)
    case status
      when 1
        '未付款'
      when 2
        '已付款'
      else
        '未知错误'
    end
  end

  def logistics_status(status)
    case status
      when 0
        '订单还未处理'
      when 1
        '备货中'
      when 2
        '已发货'
      when 3
        '已收货'
      when 4
        '已退货'
      else
        '未知错误'
    end
  end

  def country_to_select
    [
      "中国",
      "中国澳门",
      "中国台湾",
      "中国香港",
      "阿尔及利亚",
      "阿富汗",
      "阿根廷",
      "阿联酋",
      "阿曼",
      "阿塞拜疆",
      "埃及",
      "埃塞俄比亚",
      "爱尔兰",
      "安哥拉",
      "奥地利",
      "澳大利亚",
      "巴布亚新几内亚",
      "巴基斯坦",
      "巴林",
      "巴西",
      "白俄罗斯",
      "保加利亚",
      "贝宁",
      "比利时",
      "冰岛",
      "波黑",
      "波兰",
      "博茨瓦纳",
      "朝鲜",
      "赤道几内亚",
      "大溪地",
      "丹麦",
      "德国",
      "多哥",
      "俄罗斯",
      "厄瓜多尔",
      "厄立特里亚",
      "法国",
      "菲律宾",
      "斐济",
      "芬兰",
      "佛得角",
      "刚果(布)",
      "刚果(金)",
      "高棉",
      "古巴",
      "圭亚那",
      "哈萨克斯坦",
      "韩国",
      "荷兰",
      "吉尔吉斯斯坦",
      "几内亚",
      "加拿大",
      "加纳",
      "柬埔寨",
      "捷克",
      "津巴布韦",
      "喀麦隆",
      "卡塔尔",
      "科威特",
      "肯尼亚",
      "老挝",
      "黎巴嫩",
      "立陶宛",
      "利比亚",
      "罗马尼亚",
      "马达加斯加",
      "马来西亚",
      "马里",
      "马其顿",
      "毛里求斯",
      "毛里塔尼亚",
      "美国",
      "蒙古",
      "孟加拉国",
      "秘鲁",
      "缅甸",
      "摩洛哥",
      "摩洛哥公国",
      "莫桑比克",
      "墨西哥",
      "纳米比亚",
      "南非",
      "尼泊尔",
      "尼日利亚",
      "葡萄牙",
      "日本",
      "瑞典",
      "瑞士",
      "沙特阿拉伯",
      "斯里兰卡",
      "斯洛伐克",
      "苏丹",
      "塔吉克斯坦",
      "泰国",
      "坦桑尼亚",
      "突尼斯",
      "土耳其",
      "土库曼斯坦",
      "委内瑞拉",
      "文莱",
      "乌干达",
      "乌克兰",
      "乌拉圭",
      "乌兹别克斯坦",
      "西班牙",
      "希腊",
      "新加坡",
      "新西兰",
      "匈牙利",
      "叙利亚",
      "牙买加",
      "亚美尼亚",
      "也门",
      "伊拉克",
      "伊朗",
      "以色列",
      "意大利",
      "印度",
      "印尼",
      "英国",
      "约旦",
      "越南",
      "赞比亚"
    ]
  end
end
